var enjproj = {};

//项目所有属性列表
enjproj.list = ["序号", "传输编号", "受控编号", "工程名称", "甲方项目负责人", "乙方项目负责人", "项目类别", "工程属性", "项目名称", "工程地址", "甲方单位", "所属区域", "设计单位", "设计负责人", "监理单位", "监理负责人", "施工队", "施工队负责人", "委托时间", "备注"
  , "主材料供应", "申请领料日期", "实际领料日期", "主材料金额", "材料表", "备注"
  , "施工情况", "施工情况简述", "预计完工时间", "开工时间", "完工时间", "监理验收情况", "监理验收问题反馈", "甲方验收情况", "管照办理情况", "配合费（附件）", "选线费（附件）", "跟测费（附件）", "备注"
  , "竣工文本收到日期", "竣工资料施工队上交时间（附件）", "竣工文本提交日期（附件）", "甲方对竣工资料的反馈情况", "施工队工作量（表格）", "备注"
  , "合同签订情况", "合同签订日期", "合同文本（附件）", "合同总金额", "预付款", "预付款开票日期（附件）", "预付款收款日期", "进度款开票日期（附件）", "进度款收款日期", "尾款开票日期（附件）", "尾款收款日期", "是否已送审（附件）", "送审日期", "审定金额", "备注"
  , "实际收款", "施工队结款", "其他费用", "利润", "备注"];

enjproj.selectOptions = {};

//工程属性
enjproj.selectOptions.propertiesList = ['管道', '光缆', '设备', '客户端'];

//甲方单位
enjproj.selectOptions.firstpartyList = ['中国移动', '中国联通'];

//所属区域
enjproj.selectOptions.areaList = ['黄浦', '卢湾', '徐汇', '长宁', '静安', '普陀',
  '闸北', '虹口', '杨浦', '宝山', '嘉定', '浦东新区', '松江', '金山',
  '青浦', '南汇', '奉贤', '崇明'];

//设计单位
enjproj.selectOptions.designorgList = ['京移', '邮设', '华信'];

//监理单位
enjproj.selectOptions.supvorgList = ['公诚', '信产', '华讯', '铁二院', '黑龙江', '网桥'];

//施工队
enjproj.selectOptions.constructteamList = ['中邮通', '中移', '邮电', '广越', '东冠', '和勤', '电信', '久豪', '贝电', '海润', '中通二局', '翔发',
  '辉程', '龙盛', '明嬴', '盛脉', '通福', '万程', '信辰', '远鹰', '阅龙', '置诚', '兆康', '兴霸', '和联', '鸿维', '嘉正', '炜晟', '新周',
  '信潮', '众托', '共联', '中福', '长安', '都顺', '联音', '商美', '英得', '亚通', '邮顺', '渝华', '忠吕', '中铁', '天达', '虹鹰', '兴和',
  '云沪', '雨花', '晟平', '秦禧', '立天', '中通一局', '博索', '富悦', '廉创', '润风', '海剑', '宏晋', '米赛', '伟琳', '骥通', '北京工程局',
  '景合', '海缆', '煜菱', '鸿达'];

//施工情况
enjproj.selectOptions.constructstatusList = ['未开工', '在建', '完工', '受阻',
  '无法实施'];

//管照办理情况
enjproj.selectOptions.isadminList = ['办理中', '管照已上交', '情况说明已上交',
  '无需办理'];

//甲方对竣工资料的反馈情况
enjproj.selectOptions.compmatresList = ['已反馈', '未反馈'];

//合同签订情况
enjproj.selectOptions.contractstatusList = ['已签订', '未签订'];

module.exports = enjproj;