var enjproj = {};

enjproj.list = ["序号", "传输编号", "受控编号", "工程名称", "甲方项目负责人", "乙方项目负责人", "项目类别", "工程属性", "项目名称", "工程地址", "甲方单位", "所属区域", "设计单位", "设计负责人", "监理单位", "监理负责人", "施工队", "施工队负责人", "委托时间", "备注"
	, "主材料供应", "申请领料日期", "实际领料日期", "主材料金额", "材料表", "备注"
	, "施工情况", "施工情况简述", "预计完工时间", "开工时间", "完工时间", "监理验收情况", "监理验收问题反馈", "甲方验收情况", "管照办理情况", "配合费（附件）", "选线费（附件）", "跟测费（附件）", "备注"
	, "竣工文本收到日期", "竣工资料施工队上交时间（附件）", "竣工文本提交日期（附件）", "甲方对竣工资料的反馈情况", "施工队工作量（表格）", "备注"
	, "合同签订情况", "合同签订日期", "合同文本（附件）", "合同总金额", "预付款", "预付款开票日期（附件）", "预付款收款日期", "进度款开票日期（附件）", "进度款收款日期", "尾款开票日期（附件）", "尾款收款日期", "是否已送审（附件）", "送审日期", "审定金额", "备注"
	, "实际收款", "施工队结款", "其他费用", "利润", "备注"];

module.exports = enjproj;
